#!/bin/sh
set -eu

######################################################################
# 設定
######################################################################

print_usage_and_exit () {
  cat <<-USAGE 1>&2
	Usage   : ${0##*/} -t<ディレクトリT> [ディレクトリM]
	Options : 

	2つのディレクトリ内のファイルをハッシュ値で比較し、
	対応がないファイルをリスト化して出力する。
	USAGE
  exit 1
}

######################################################################
# パラメータ
######################################################################

# 変数を初期化
opr=''
opt_t=''

# 引数をパース
i=1
for arg in ${1+"$@"}
do
  case "$arg" in
    -h|--help|--version) print_usage_and_exit ;;
    -t*)                 opt_t=${arg#-t}      ;;
    *)
      if [ $i -eq $# ] && [ -z "$opr" ]; then
        opr=$arg
      else
        echo "${0##*/}: invalid args" 1>&2
        exit 11
      fi
      ;;
  esac

  i=$((i + 1))
done

# ディレクトリであるか判定
if [ ! -d "$opr" ]; then
  echo "${0##*/}: a direcoty must be specified" 1>&2
  exit 21
fi

# ディレクトリであるか判定
if [ ! -d "$opt_t" ]; then
  echo "${0##*/}: a direcoty must be specified" 1>&2
  exit 21
fi

# パラメータを決定
mdir=$opr
tdir=$opt_t

######################################################################
# 本体処理
######################################################################

